Revit 2027 API
Form.IsFaceReference Method
Tell if the pick is the reference to a face of the form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFaceReference(
	Reference faceReference
)
Public Function IsFaceReference (
	faceReference As Reference
) As Boolean
public:
bool IsFaceReference(
	Reference^ faceReference
)
member IsFaceReference :
        faceReference : Reference -> bool
Parameters
faceReference Reference
Reference to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace